examples/last.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:sch="http://gost34.ibs.ru/WrapperService/Schema" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <xenc:EncryptionMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gost28147"/>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
                    <xenc:EncryptionMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:transport-gost2001"/>
                    <ds:KeyInfo>
                        <ds:X509Data>
                            <ds:X509Certificate>MIIGSzCCBfqgAwIBAgIQAdNMbd50DNAAAAAQAAUAATAIBgYqhQMCAgMwgeoxLzAt
BgNVBAoMJtCi0LXRgdGC0L7QstGL0Lkg0KPQpiDQmNC90YTQvtCi0LXQmtChMUQw
QgYDVQQLDDvQo9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNC5INC4INC60LvRjtGH
0LXQstC+0Lkg0YbQtdC90YLRgDEjMCEGA1UEDAwa0JDQtNC80LjQvdC40YHRgtGA
0LDRgtC+0YAxTDBKBgNVBAMMQ9CQ0LTQvNC40L3QuNGB0YLRgNCw0YLQvtGAINCi
0LXRgdGC0L7QstC+0LPQviDQo9CmINCY0L3RhNC+0KLQtdCa0KEwHhcNMTcxMDI0
MDIxNDAwWhcNMTgxMDIwMjA1OTU5WjCCAjwxIDAeBgNVBAwMF9CT0LvQsNCy0L3R
i9C5INCy0YDQsNGHMRkwFwYDVQQEDBDQmNC70YzQtdC90LrQvtCyMTAwLgYDVQQJ
DCfRg9C7LiDQuNC8LiDQmC7QoS7QndC40LrQuNGC0LjQvdCwLCAx0JIxLTArBgNV
BAgMJDI0INCa0YDQsNGB0L3QvtGP0YDRgdC60LjQuSDQutGA0LDQuTFRME8GA1UE
CgxI0JrQk9CR0KPQlyDQmtCa0J7QmtCRINC40LwuINC/0YDQvtGE0LXRgdGB0L7R
gNCwINCfLtCTLiDQnNCw0LrQsNGA0L7QstCwMSMwIQYDVQQLDBrQkNC00LzQuNC9
0LjRgdGC0YDQsNGG0LjRjzEhMB8GA1UEBwwY0LMuINCa0YDQsNGB0L3QvtGP0YDR
gdC6MRYwFAYFKoUDZAMSCzEyNzg1MzI2NzgzMRgwFgYFKoUDZAESDTExMDI0Njgw
MTYyMzIxGjAYBggqhQMDgQMBARIMMDAyNDY1MjM1MTgyMTYwNAYDVQQqDC3QodGC
0LDQvdC40YHQu9Cw0LIg0KHRgtCw0L3QuNGB0LvQsNCy0L7QstC40YcxGzAZBgkq
hkiG9w0BCQEWDG1haWxAbWFpbC5ydTELMAkGA1UEBhMCUlUxUTBPBgNVBAMMSNCa
0JPQkdCj0Jcg0JrQmtCe0JrQkSDQuNC8LiDQv9GA0L7RhNC10YHRgdC+0YDQsCDQ
ny7Qky4g0JzQsNC60LDRgNC+0LLQsDBjMBwGBiqFAwICEzASBgcqhQMCAiQABgcq
hQMCAh4BA0MABEAddQnA1eqDWwo6+dM14mPvl78U+hLWWoMgP502iFwxPWng9ieT
4SO9NrweD25Dii2G9Efgu5ceE3c+y3zLoEhOgQkAMDAwNTAwMDGjggIYMIICFDAO
BgNVHQ8BAf8EBAMCBPAwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMEMB0G
A1UdDgQWBBTythcqm5sSikYb0EgV1w4JDHMFozAMBgNVHRMBAf8EAjAAMIIBKAYD
VR0jBIIBHzCCARuAFC34Jde692hgk7Y33SVq6a2F9s4foYHwpIHtMIHqMS8wLQYD
VQQKDCbQotC10YHRgtC+0LLRi9C5INCj0KYg0JjQvdGE0L7QotC10JrQoTFEMEIG
A1UECww70KPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQuSDQuCDQutC70Y7Rh9C1
0LLQvtC5INGG0LXQvdGC0YAxIzAhBgNVBAwMGtCQ0LTQvNC40L3QuNGB0YLRgNCw
0YLQvtGAMUwwSgYDVQQDDEPQkNC00LzQuNC90LjRgdGC0YDQsNGC0L7RgCDQotC1
0YHRgtC+0LLQvtCz0L4g0KPQpiDQmNC90YTQvtCi0LXQmtChghAB00mhXFwf4AAA
AA4ABQABMGIGCiqFAwIEAQEBAQYEVDBSpFAwTjEvMC0GA1UECgwm0KLQtdGB0YLQ
vtCy0YvQuSDQo9CmINCY0L3RhNC+0KLQtdCa0KExGzAZBgNVBAMMElJlZ2lzdHJh
dGlvbiBQb2ludDAmBgoqhQMCBAEBAQEHBBgwFoAU++viyabo1wRVvYHBEK06E20J
7GIwCAYGKoUDAgIDA0EAhKvp4qI/OJUsKWDlS84NIGHENAJGaju7plpwk0oPR/X7
7T/p6t9OAaYMWSR2++12Yiz8AsrB7DyScRxTaiaeqQ==</ds:X509Certificate>
                        </ds:X509Data>
                    </ds:KeyInfo>
                    <xenc:CipherData>
                        <xenc:CipherValue>MIGkMCgEIFHwRY9B13f8M0P11a3RJu61uyKkqF5npegVy6l+3odkBASQoxEvoHgGByqFAwICHwGgYzAcBgYqhQMCAhMwEgYH
KoUDAgIkAAYHKoUDAgIeAQNDAARA3ODm/lwdoUdZQw3cSCJOSSpmxzrI+dyOdZT8AiFGwFVPfOAbysRM4B7/rJkY6gSXdpNX
6GnhC7hTN8hUEDWwzAQIGbzth2yspsM=</xenc:CipherValue>
                    </xenc:CipherData>
                </xenc:EncryptedKey>
            </ds:KeyInfo>
            <xenc:CipherData>
                <xenc:CipherValue>clOt05zSf2h5RaKZaFL6YqD3at/9UT3c3PKNVKKKHrlGaRaA0QREXDo1FmyQXEfQjlGHZPFMwcY3JsTyh/VPP5m+8df30X22
z/7kx3h0EhH6DbYj+5gkcha7v3Fx+OYbl+neMqimjHSVZ5h+ardEPP+yivypr1+n+tKekJg3sat9S90nuJtZixdE48byKpC8
ktZjaIktibNj98Gx2GwQnIaCFqC5NeqDTDX/cJAcxbQc5wAYwaJlPZCOZHi0mAldmouudNDF10EppoPLKR0J56yPrKDBuOVv
HhzuZYvbFGla8yu/RFSDzG6X31Xgzd6w/9pQUQSDsxK8ZPRNO6V+bVsut/ePuOt2Kh2j/0Pb6UPxxYSNckYSTl/FFnzib2yl
mHOnVqXKJRcW1Hg/MCf3mNbrvKYUbmRpp00T8MXNQSznQgEDsXoKr229Yp8MaFKKk+wv6e8TAQ+gwThRcmRv0QSMSkTd6HKC
WdofVJkY+/lGIohYcSPkNqYP9N4wyEL30pvlgGe1tzE38GQF4sfPRwKPz/SfAgd+V+FRZPK1gic+9x3yp0kbxYnIfkOcU7mD
+5vg2Hlb3Erwy2d8seGbaQ/iIW7WTBFAZBOcAyhlP20l/PaCE7BlSES1BjeHfxLP7HpGKWA+r28b7Au5w+sX6ieTXiYS6w14
NDHarXSWuvHTcvfFu0arRtALmKcOW5faJ7u6Dnr3z99bA7PXkuZRUzSENeJxqQiZNeV5rwxdswgk9cMikcJ3fVDFQ0k7uyC/
6rjhVxKxLs/HhQz3LXdLrE2uTzoF/9fbOBWPQHWTd4jTLbeFtJOWVPk56kfy6dJlV8tcCJQyl2nJzdIoUOlE/mDYUzGEnmbw
Gp87ktPjmsx/8Nj1VlspEhWj2N4j2Ok/4io5Dbx8pCSLXuaHUopVfzQBiEAf4Sb1+rZQSoTn9nj7CA9keIlPKcxo2EqjPisw
NyI3kPmvyb+aRRGVsy993j9jNBnzhktr1pIq/DZziyr1I++EkeWESuNLTHiAHuPJZdEaTSBGWys+rcnxPGdOCY/2EbPJEqhG
9YtZ+Mq1Ze3FEJ5GMugiML1+C+eJsMjxEW/VF5NieANmBcvwaj4swZ9kao0x5P6jAnirYP0wcsidj1bwNhrlx9HT0IV2VFfV
q1fECwswDE4Ed0ozWnH4KMTWx14C/LiTU/VljhXa97uaGvIdsqRsfylWjnlcFhbCfPyP+HH1nHF7P2sS8rzo0IJgjl/C/VEf
KnIZ3ocHfX7Qi8hfMEjinwhw5X7LVYbyPSWstHXS/bF5HuSu7gLPRrx2UlicoYPOvIRQV2rQoV60S+RCAXEwjHHsXejgl2NK
beGREjGlwvdR1fMElxK2MH8EffP7po/dZGahTzNz8ZK6QB/xabyu9+dPOB2FlT6GJm31LQiumM3IBodLBkAvbWSMIMkb/Dj6
GSDGeq1kvPYbVnxvhMj8tgww/F9skcJxJYgZM6ZTlR7k5m+CqP40cuCF2CO5Y8g5c9OXDKqm5rrqHa9FOs9PfTRVy/O4+4og
tNrWq87da90oq3mOUdJN46g2gkZoo0WTuTMS0j8LgNs4KorMoq222oLl5MauWNovQf9zpFH0ga/q/Q/M/nnpZpx3BMLpBmhT
c4oVzHdDuUa9OOBlf0mVQ7E6bogp5w5RxSxOoRpNJObS7Hdx29NWDM6zRmk4BdqyMbPW5czDREzBuZERB/zsb9FKtzBgkeBQ
vqGAez7FC4f3hy4uuPQAigzmM1LzHTdznw4gkWlK3jzhSfNFyXG42JjyM7QOkrcS3CkE1flhJNHdXR4jCLH6nON2VhCfmyiV
kCxoR91u5isWOsmrvGGcz8fJPSty/uW6kGFE8iW3kmM+R+3lkDt65wA0g1+J/DnqFnMoV5Cup5xBfaZy852k6RB434xLlOV8
507cF5njNOFh7gS3U2sgNqRN0u6dgPW96mxP5xFOd5GLPmMDWH48Di/BKAPmQsZqAnRGaOkVyJlby7lP1SK8DIbYPUthk44U
sfJtOFIfTf8mXhG0OePKSfk6qyWw8zmG1Ci42LSZcix3dCOcr0Und167uZyH55Yjk5eTnN9MiiplNudy/rYhZ4C9frKHq9xH
tJihgd6x1XDEuXPDsBywM3yM30OO6e9ERnBTCZ/J9QLglo1kpqeGE1ABaN0IoIygtAui7uA/2dtyXte/P3j9VI9ENn36vZop
TPG9KVz9IJfyv9pTDBnwH94SVZuogEiBhzoYobW99cJP4v/Jcjo/XorsiyCjTrt/S9ACBXO2eKSjSJIrUBgM8TyOeKpdvCLu
xrLcpYAC0C/0wgYONTO/8+0DmuPCFVJ1bFjJMtqv3BqD0yNmorTUrDyyCXCs11vtW7mElg6s3sC0DVpQtae3wUbgAFolJTkz
y59HZMOyV65WR2t/j/QBpd4zruT5gzsWK63Bl3ucrKYrr9t14hup03vkImcWbVM+pjLjh3m3fLhhYPR7NeYfonkNDY6pzCEC
bH0oYVF4js3pgUIBEy7/KJvO2oUHVobpK4YUo985gfqNu6eyvryijJl/nfQPnYgbXiP6qDMwDc5nboRlQV9tpsQx1aZtDGWi
dItYQz1YqUpOjFF73PZHzz3VRoQ9ZaI6g5BZV8B/Vp/NpYRLAcqBHRlTsafVu/XlSr9/5mcGa/fORAqBg0uJ+ITWZVGfHtv9
SWV3nfnt3AJqT1PlJVFIftoge5ezPD4RWcvM/LXknQCLvyBbqWT+vsHTvJmpRWic5XG2d8zSJrz6rwlIlUcIcVvMuSnqKAbO
MwFQ5Zo/uyEOwmXxcE4FhddThNwDurZal+UMvuszdm6JzP7JIWbhxxJ032EyUIyItQfiY0wNLxXBgbqbYfNbCizFwBoNmR3D
8ZDk8ToHGV9j0umNsMRMkgkNEDttZnKftQPEIhmHZEBSOqXd/xVF1UpS/HcKpQ/HQ6XD0ed9UB5rFrO+gOCA7p8NJPVPiAme
nqVcd6NaylowwWfJTWHnc1f9AB1+956a3GQwOq4vS3Ob+fqPZwuJnHEbNECtUEdCzjqUxzCsj5sPrIJYbppKLoreI9scz/GG
I9BnU7wnZNiOHYeuO9U5G8V9scUciUgjH0shZCol2fpUR+ZoUs5SoANU08n1rdgXlS6kX6XVsGsvkQGEt1f1zHMnjiGzUmC0
8VK7XJagG0F+BisLGxFvXSOwDCN169uh9+DF18eak51lAhW9QzYaSUC2seizEoZFaTVLcxv4taSUYrLDwst/yfzBDaYNMvI/
pKzOVmkq6JLrZToakMZdPAWHiEKLDcb7wipcYKNL6sihOP/s43gKMlh+tIobh1Pn/KnfZyCEEUMf9TNOxOFFKqdUPw6VveGO
tOZaEvRL/vfte4UuEK4kfK0ApkQTR6ksa61UUM31jxVG2AUp4rb5jm7fwq/4nOv75EIGWf3COp9Sk9B5gTSKlBn9JOCO8INi
dei1M5v2YYilfITETGQb2yfu5VYjxUDya8dFF28Pm2QScwm3GQ7K3XPGGTxus7FcdommzjKTskDB0P3qb+zNq21uMnwVXeur
Zvx3gnHhpcxCgqzLCxvYrAHUbOHZ+kC+l9jxofYy3tIFRD6Wfpuun0ynLTfwWBvADtjxeQ0DyrzXDLHWorDAYax2NlKMgb5P
bssKPAnlXaLa9DpKKw0PEpLsfA9bTFceOAZcOFZGfj24rHy6F947EH5ThMP/ZAYfHlr4qWOEglQ8urogiofjdx2EDRfo5QRm
cJrkrHZLmJcRjcN+l/tMcvNomvXCPUvZ3tGoFfwjqJTTQXJCD86iDUQHhD2MWiBtqk4KBkFtBF6Yx6h+5CyG+v+UwSqfhXKw
5MgB+uCuBp2WR0YNuXZ6LVjuqQJDd0deTR7ZaUcWCBqKqqGu1OJiC502asfDa7In7g9Meqo140X6qakoFKRR9T3fxHhZbJ4L
2/V6OD4QWXW2mSy1xb27803fO00q1KSIsQMIODqVpzY+NsShW/vsxcB5BrOphyMub6FYj0X3VNhZVPQ0dijRmvBMJy+sRyFL
2ruClNwelUyOGcLo2My5/sUOCDBT8PiuWSb4oLWslJdBpl5LPeP+BOYvr9cQ3P9kQJiOrGA0CFB+m0SVtZtyRTveDqkWZKO+
T6ET5DFRNQGQC44hUwhGbxd54/CnEn2jZBCbg54QdPGp/icm2yOcyoIE1XjOyrIou8ihhunPZM3HiRzElOrFFxwzEoHAOH6P
eY2UoxXvthadGQVoRVlgE9o0vmhlnIFuksSnqmtxTd/94PZWfQqfXt5Fiv8aIRfu5X6ARDmIl63U0FNRZeF8DOZdSZBsFZWJ
7jSbcEGXv/PBd5mH/tW0o9G35UVe2rumW3qw4V8jf+QashB0WnpdxvCgDZ6YtFiPhPa045ef+KfdbvcEhtXxc88LVRU5u0Y+
IGJOcWFyXihzfBZLJdpoelT+Hhc+0oRNrZ74ZItvxzhQe1Ps7OKbhUGxA4vTHBgGOaeUWZ/yCZQ9FZD/3zU46laHkO8vQU5t
/ro3xc1wdMge9lk5TH8n9gFmvqTCjS5fCm+X/ASUdWljhdNbTk3Rf63l6VB1U/01SOKwyYwO1zuXT/a7mhqCrlN67kC21XGo
MAyHxiMQShYcYUH50RYeqI6sxJcsI2FjA+S53nJtbDqqTkky+jsUZzki+Inqjz+UlkPSvmNUVUS1nSPsZhi6zpviOnEXXiEl
S8woYaVFKX9mrmmBE0lLvGcmyG/9+VC4UYAiKUBhcFY55mZuuITJvXctotfTJhESsMHXrQ8cwlwJPG4lA3FTPc4x6I0esuqn
U1Gt2qlnknVlx2+Is1CV/nsMgzzpssPgLrf6l0pEKoiCGGN2X2upH7CR75kMvKyVVzYnFnKGaLu/dBdUU3V0Iv6nUn+aQjWL
9UxkBhNlR1VGusizofdffQB+nz456JXdgki+0Z1e7tqpaTwNhOU/f2StoBQumRdh/Op8kLQ4LoTaQ/xZIe0iqw3c76wtwD2S
d40cutYxqD4QRWpx91ShJiVZMmvPy1aH+Q2PHhU0s8y2fOMtfEf/3zfCmd8JegMF3HCd6rzK0aD15GC871ow7OZ7qZ/hk4gb
GMyvEpWhWe2wuhhkhJFXgD0rO3HAGx5xf51qiV421jsvL8aVAdN3pYK/04zteRbw9+MS8MBr2YoRP+J68UlSaNK3JByr0k2l
wBjLNw82PxVnWp/NbvntSY2U8E/ybDRon6kIn80SSoar++axXr4+vMBqyTXN+yEjts3vY5aE1T7n4kFzYuTAorifRymxyy0p
GW1pPUJlG6aSc2PbSgcZQNHGZjOhymouzyHM/JhVwOBMpJ3rs7fgPnEDLn81ZZFt2XVLZbDC0xIn3uudfSUb+K3Zor98x0IC
VvRAy+NEs8s3gEWrfpaeiCF2V0hrHUBPFGwS1Fri9Xg3M1N5ZmWj1JQwuS0P1s9Ev/iEFQ2nYmVEmTzmoZBaWlLhUNrV2S+j
KbNZqQztYllctpaoiMA1cCXYaFt6TpJtgjDxPAc2d7qlnXRJ5FFcQGw9ye5ApLdCEwWC02HWZp/2IgXouXgVdBlQyAOwji6F
tBgM33EwMXRumU4=</xenc:CipherValue>
            </xenc:CipherData>
        </xenc:EncryptedData>
    </soapenv:Body>
</soapenv:Envelope>